---
kind: type
id: T:Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs
source: html/939b55de-12e5-2117-5fbc-471f8bb009c9.htm
---
# Autodesk.Revit.DB.DuplicateTypeNamesHandlerArgs

A structure that provides information about an attempt to copy types with names that already exist in the destination document.

## Syntax (C#)
```csharp
public class DuplicateTypeNamesHandlerArgs : IDisposable
```